; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=50, out_folder=htg/blocksworld/training, instance_id=30, seed=2054

(define (problem blocksworld-30)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 - object)
 (:init 
    (arm-empty)
    (clear b4)
    (on b4 b31)
    (on b31 b33)
    (on b33 b41)
    (on b41 b26)
    (on b26 b29)
    (on b29 b48)
    (on-table b48)
    (clear b28)
    (on b28 b49)
    (on b49 b12)
    (on b12 b7)
    (on-table b7)
    (clear b45)
    (on b45 b9)
    (on b9 b3)
    (on b3 b13)
    (on b13 b21)
    (on b21 b19)
    (on b19 b38)
    (on b38 b25)
    (on-table b25)
    (clear b18)
    (on b18 b37)
    (on b37 b42)
    (on b42 b44)
    (on b44 b43)
    (on b43 b5)
    (on b5 b6)
    (on b6 b17)
    (on b17 b32)
    (on b32 b30)
    (on-table b30)
    (clear b22)
    (on b22 b10)
    (on b10 b27)
    (on b27 b1)
    (on b1 b40)
    (on b40 b39)
    (on b39 b2)
    (on b2 b47)
    (on b47 b16)
    (on-table b16)
    (clear b34)
    (on b34 b11)
    (on b11 b24)
    (on b24 b50)
    (on b50 b15)
    (on b15 b36)
    (on b36 b20)
    (on b20 b46)
    (on b46 b23)
    (on b23 b8)
    (on b8 b35)
    (on b35 b14)
    (on-table b14))
 (:goal  (and 
    (clear b4)
    (on b4 b5)
    (on b5 b1)
    (on-table b1)
    (clear b3)
    (on b3 b2)
    (on-table b2))))

; plan
1. (unstack b45 b9)
   deleted: (on b45 b9) (clear b45) (arm-empty)
   added: (holding b45) (clear b9)
   goals met: 1 of 7
2. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 1 of 7
3. (unstack b9 b3)
   deleted: (on b9 b3) (clear b9) (arm-empty)
   added: (holding b9) (clear b3)
   goals met: 2 of 7
4. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 7
5. (unstack b22 b10)
   deleted: (on b22 b10) (clear b22) (arm-empty)
   added: (holding b22) (clear b10)
   goals met: 2 of 7
6. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 2 of 7
7. (unstack b10 b27)
   deleted: (on b10 b27) (clear b10) (arm-empty)
   added: (holding b10) (clear b27)
   goals met: 2 of 7
8. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 7
9. (unstack b27 b1)
   deleted: (on b27 b1) (clear b27) (arm-empty)
   added: (holding b27) (clear b1)
   goals met: 2 of 7
10. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 2 of 7
11. (unstack b1 b40)
   deleted: (on b1 b40) (clear b1) (arm-empty)
   added: (holding b1) (clear b40)
   goals met: 2 of 7
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 7
13. (unstack b40 b39)
   deleted: (on b40 b39) (clear b40) (arm-empty)
   added: (holding b40) (clear b39)
   goals met: 3 of 7
14. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 7
15. (unstack b39 b2)
   deleted: (on b39 b2) (clear b39) (arm-empty)
   added: (holding b39) (clear b2)
   goals met: 3 of 7
16. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 3 of 7
17. (unstack b2 b47)
   deleted: (on b2 b47) (clear b2) (arm-empty)
   added: (holding b2) (clear b47)
   goals met: 3 of 7
18. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 4 of 7
19. (unstack b3 b13)
   deleted: (on b3 b13) (clear b3) (arm-empty)
   added: (holding b3) (clear b13)
   goals met: 3 of 7
20. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 5 of 7
21. (unstack b18 b37)
   deleted: (on b18 b37) (clear b18) (arm-empty)
   added: (holding b18) (clear b37)
   goals met: 5 of 7
22. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 5 of 7
23. (unstack b37 b42)
   deleted: (on b37 b42) (clear b37) (arm-empty)
   added: (holding b37) (clear b42)
   goals met: 5 of 7
24. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 5 of 7
25. (unstack b42 b44)
   deleted: (on b42 b44) (clear b42) (arm-empty)
   added: (holding b42) (clear b44)
   goals met: 5 of 7
26. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 5 of 7
27. (unstack b44 b43)
   deleted: (on b44 b43) (clear b44) (arm-empty)
   added: (holding b44) (clear b43)
   goals met: 5 of 7
28. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 5 of 7
29. (unstack b43 b5)
   deleted: (on b43 b5) (clear b43) (arm-empty)
   added: (holding b43) (clear b5)
   goals met: 5 of 7
30. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 5 of 7
31. (unstack b5 b6)
   deleted: (on b5 b6) (clear b5) (arm-empty)
   added: (holding b5) (clear b6)
   goals met: 5 of 7
32. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 6 of 7
33. (unstack b4 b31)
   deleted: (on b4 b31) (clear b4) (arm-empty)
   added: (holding b4) (clear b31)
   goals met: 5 of 7
34. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 7 of 7
